Repository: linem7/Chatbot
Catalog: App/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: A double ⌘ opens the Quick Panel from anywhere. The key combination no longer works while this is on.
zh_hans: 在任意界面连按两次 ⌘ 都能唤起 Quick Panel。开启后上面的按键组合不再生效。

source: Accepts images
zh_hans: 可以接受图片

source: Add
zh_hans: 添加

source: Add Connection
zh_hans: 添加 Connection

source: Add Connection…
zh_hans: 添加 Connection…

source: Add Files…
zh_hans: 添加附件…

source: Add a Connection with the + button, then paste your API key.
zh_hans: 点「+」添加一个 Connection，然后粘贴 API key。

source: Add a model ID manually
zh_hans: 手动填写模型 ID

source: Advanced
zh_hans: 高级

source: Alibaba Cloud Model Studio
zh_hans: 阿里云百炼

source: All conversations and their attachments will be deleted. This can't be undone.
zh_hans: 所有对话及其附件都会被删除，无法恢复。

source: All conversations that use this Connection will be deleted too. This can't be undone.
zh_hans: 用这个 Connection 的所有对话也会一起删除，无法恢复。

source: Allow Chatbot in System Settings › General › Login Items & Extensions.
zh_hans: 请在「系统设置 › 通用 › 登录项与扩展」里允许 Chatbot。

source: Allow Chatbot in System Settings › Privacy & Security › Accessibility. Until then the key combination above still works.
zh_hans: 请在 System Settings › Privacy & Security › Accessibility 里允许 Chatbot。在此之前上面的按键组合仍然可用。

source: Ask anything
zh_hans: 问点什么…

source: Can search the web
zh_hans: 可以联网搜索

source: Choose a Default Model for new conversations.
zh_hans: 请为新对话选择一个默认 Model。

source: Clear All History
zh_hans: 清空全部历史

source: Clear all history?
zh_hans: 要清空全部历史吗？

source: Clear…
zh_hans: 清空…

source: Combination
zh_hans: 组合

source: Connections
zh_hans: Connection

source: Continue in Quick Panel
zh_hans: 在 Quick Panel 中继续

source: Copied
zh_hans: 已复制

source: Copy
zh_hans: 复制

source: Couldn't read the API key from the Keychain.
zh_hans: 无法从钥匙串读取 API key。

source: Couldn't read “%@”.
zh_hans: 无法读取「%@」。

source: Couldn't save the API key to the Keychain.
zh_hans: 无法把 API key 存进钥匙串。

source: Custom
zh_hans: 自定义

source: Default Model
zh_hans: 默认 Model

source: Delete
zh_hans: 删除

source: Delete Connection…
zh_hans: 删除 Connection…

source: Delete “%@”?
zh_hans: 要删除「%@」吗？

source: Deletes every conversation and its attachments.
zh_hans: 删除所有对话及其附件。

source: Enter a valid base URL, starting with https://.
zh_hans: 请填写有效的 base URL，以 https:// 开头。

source: For the Singapore region, change the host to dashscope-intl.aliyuncs.com.
zh_hans: 新加坡地域请改成 dashscope-intl.aliyuncs.com。

source: General
zh_hans: 通用

source: Hotkey
zh_hans: 全局快捷键

source: Hotkey %@ is used by macOS
zh_hans: 全局快捷键 %@ 已被 macOS 占用

source: If nothing happens when you press the Hotkey, it may conflict with another app such as ChatGPT. Try a different combination.
zh_hans: 如果按下全局快捷键没有反应，可能和 ChatGPT 等 app 冲突，请换一个组合。

source: Interrupted
zh_hans: 已中断

source: Key combination
zh_hans: 按键组合

source: Launch at Login
zh_hans: 开机时启动

source: Model ID
zh_hans: 模型 ID

source: Models
zh_hans: Model

source: Name
zh_hans: 名称

source: Network connection failed.
zh_hans: 网络连接失败。

source: New Conversation
zh_hans: 新对话

source: New Conversation (⌘N)
zh_hans: 新对话（⌘N）

source: No Connection
zh_hans: 没有 Connection

source: No Conversation Selected
zh_hans: 没有选中对话

source: No Conversations
zh_hans: 还没有对话

source: No models yet. Save to fetch them, or add a model ID below.
zh_hans: 还没有 Model。保存后会自动拉取，也可以在下面手动填写模型 ID。

source: None
zh_hans: 无

source: Only for models that can search. The globe button still turns it on or off for the current conversation.
zh_hans: 只对能联网的模型有效。地球按钮仍然可以对当前对话打开或关闭联网。

source: Open Accessibility
zh_hans: 打开辅助功能

source: Open Login Items
zh_hans: 打开登录项

source: Open Main Window
zh_hans: 打开主窗口

source: Open Settings
zh_hans: 打开设置

source: Open in Main Window
zh_hans: 在主窗口中打开

source: OpenAI Compatible
zh_hans: OpenAI 兼容

source: Paste an API key.
zh_hans: 请粘贴 API key。

source: Paste your API key
zh_hans: 粘贴 API key

source: Pasted Image
zh_hans: 粘贴的图片

source: Pin: keep the panel in front of other windows
zh_hans: 固定：让面板一直保持在其它窗口之前

source: Press ⌘ twice
zh_hans: 连按两次 ⌘

source: Pressing it won't open the Quick Panel. Turn off that shortcut in System Settings › Keyboard › Keyboard Shortcuts, or choose another Hotkey in Chatbot's settings.
zh_hans: 按下它打不开面板。请在「系统设置 › 键盘 › 键盘快捷键」里关掉那个系统快捷键，或者在 Chatbot 的设置里换一个全局快捷键。

source: Quit Chatbot
zh_hans: 退出 Chatbot

source: Remove
zh_hans: 移除

source: Restore Default
zh_hans: 恢复默认

source: Retry
zh_hans: 重试

source: Save
zh_hans: 保存

source: Save Without Testing
zh_hans: 不测试，直接保存

source: Saved — paste a new key to replace it
zh_hans: 已保存，粘贴新的 key 可以替换

source: Saving fetches the model list, which also tests the connection.
zh_hans: 保存时会拉取 Model 列表，这一步同时就是连接测试。

source: Search the Web in New Conversations
zh_hans: 新对话默认联网

source: Searched: %@
zh_hans: 搜索了：%@

source: Searching: %@
zh_hans: 正在搜索：%@

source: Send (⏎)
zh_hans: 发送（⏎）

source: Settings…
zh_hans: 设置…

source: Sources
zh_hans: 来源

source: Stop (⌘.)
zh_hans: 停止（⌘.）

source: The API key is invalid or has expired.
zh_hans: API key 无效或已过期。

source: The current model can't accept images.
zh_hans: 当前模型不能接受图片。

source: The current model doesn't support this input.
zh_hans: 当前模型不支持这种输入。

source: The current model doesn't support web search.
zh_hans: 当前模型不支持联网

source: The service is temporarily unavailable.
zh_hans: 服务暂时不可用。

source: This conversation is too long. Start a new one.
zh_hans: 对话太长了，请新开一个对话。

source: Today's date is added at the start automatically.
zh_hans: 发送时会自动在最前面加上当天日期。

source: Too many requests or out of quota.
zh_hans: 请求太频繁或额度已用完。

source: Too many requests or out of quota. Try again in %lld seconds.
zh_hans: 请求太频繁或额度已用完，请 %lld 秒后再试。

source: Unpin: hide the panel when it loses focus
zh_hans: 取消固定：失焦时重新收起面板

source: Untitled
zh_hans: 未命名

source: Using a relay for Claude or Gemini? If it supports their native API, choose Anthropic or Gemini here so web search works. Leave /v1 and /v1beta off the base URL.
zh_hans: 通过中转使用 Claude 或 Gemini？中转支持原生格式时，请在这里选 Anthropic 或 Gemini，这样才能联网。base URL 不要带 /v1 或 /v1beta。

source: Web Search: Off
zh_hans: 联网搜索：已关闭

source: Web Search: On
zh_hans: 联网搜索：已开启

source: What can I help with?
zh_hans: 有什么可以帮你？

source: “%@” has no text to extract. It may be a scanned PDF.
zh_hans: 「%@」里没有可以抽取的文字，可能是扫描版 PDF。

source: “%@” isn't a supported file type.
zh_hans: 不支持「%@」这种文件类型。

source: ⏎ Send · ⇧⏎ New Line
zh_hans: ⏎ 发送 · ⇧⏎ 换行
